; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=339, out_folder=htg/blocksworld/training, instance_id=73, seed=2097, goal_proportion=0.03

(define (problem blocksworld-73)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 b337 b338 b339 - object)
 (:init 
    (arm-empty)
    (clear b78)
    (on b78 b255)
    (on b255 b212)
    (on b212 b5)
    (on b5 b224)
    (on b224 b58)
    (on b58 b166)
    (on-table b166)
    (clear b251)
    (on b251 b198)
    (on b198 b283)
    (on b283 b95)
    (on b95 b201)
    (on-table b201)
    (clear b127)
    (on b127 b67)
    (on b67 b297)
    (on-table b297)
    (clear b152)
    (on b152 b8)
    (on b8 b229)
    (on-table b229)
    (clear b143)
    (on b143 b334)
    (on-table b334)
    (clear b144)
    (on b144 b115)
    (on-table b115)
    (clear b154)
    (on b154 b245)
    (on b245 b9)
    (on-table b9)
    (clear b274)
    (on-table b274)
    (clear b51)
    (on b51 b219)
    (on-table b219)
    (clear b169)
    (on b169 b195)
    (on b195 b189)
    (on b189 b330)
    (on b330 b217)
    (on b217 b286)
    (on b286 b90)
    (on b90 b294)
    (on b294 b266)
    (on b266 b89)
    (on b89 b124)
    (on-table b124)
    (clear b304)
    (on-table b304)
    (clear b329)
    (on b329 b338)
    (on b338 b289)
    (on b289 b221)
    (on b221 b225)
    (on-table b225)
    (clear b235)
    (on-table b235)
    (clear b109)
    (on b109 b18)
    (on b18 b81)
    (on b81 b308)
    (on b308 b44)
    (on b44 b172)
    (on-table b172)
    (clear b242)
    (on-table b242)
    (clear b121)
    (on b121 b77)
    (on b77 b42)
    (on b42 b203)
    (on-table b203)
    (clear b24)
    (on b24 b249)
    (on b249 b98)
    (on b98 b178)
    (on b178 b155)
    (on b155 b40)
    (on b40 b310)
    (on b310 b317)
    (on-table b317)
    (clear b38)
    (on-table b38)
    (clear b22)
    (on b22 b179)
    (on b179 b68)
    (on b68 b236)
    (on b236 b118)
    (on b118 b137)
    (on b137 b295)
    (on b295 b139)
    (on b139 b300)
    (on b300 b323)
    (on-table b323)
    (clear b243)
    (on b243 b252)
    (on b252 b206)
    (on b206 b29)
    (on-table b29)
    (clear b204)
    (on-table b204)
    (clear b190)
    (on b190 b315)
    (on b315 b273)
    (on b273 b281)
    (on-table b281)
    (clear b288)
    (on b288 b337)
    (on b337 b253)
    (on b253 b153)
    (on b153 b97)
    (on b97 b1)
    (on b1 b336)
    (on b336 b148)
    (on b148 b74)
    (on-table b74)
    (clear b218)
    (on b218 b117)
    (on b117 b96)
    (on-table b96)
    (clear b202)
    (on b202 b46)
    (on b46 b244)
    (on-table b244)
    (clear b34)
    (on b34 b291)
    (on b291 b65)
    (on b65 b326)
    (on-table b326)
    (clear b112)
    (on b112 b173)
    (on b173 b135)
    (on-table b135)
    (clear b79)
    (on b79 b163)
    (on-table b163)
    (clear b299)
    (on b299 b322)
    (on b322 b215)
    (on b215 b306)
    (on-table b306)
    (clear b296)
    (on b296 b75)
    (on-table b75)
    (clear b61)
    (on b61 b10)
    (on-table b10)
    (clear b39)
    (on b39 b126)
    (on b126 b264)
    (on b264 b174)
    (on b174 b87)
    (on-table b87)
    (clear b35)
    (on-table b35)
    (clear b69)
    (on b69 b3)
    (on b3 b142)
    (on b142 b328)
    (on b328 b21)
    (on b21 b228)
    (on-table b228)
    (clear b248)
    (on b248 b70)
    (on b70 b162)
    (on b162 b311)
    (on b311 b256)
    (on-table b256)
    (clear b63)
    (on-table b63)
    (clear b131)
    (on-table b131)
    (clear b17)
    (on-table b17)
    (clear b234)
    (on b234 b147)
    (on b147 b314)
    (on-table b314)
    (clear b104)
    (on-table b104)
    (clear b80)
    (on b80 b208)
    (on b208 b23)
    (on b23 b125)
    (on-table b125)
    (clear b91)
    (on b91 b128)
    (on b128 b99)
    (on b99 b192)
    (on b192 b285)
    (on-table b285)
    (clear b168)
    (on-table b168)
    (clear b36)
    (on b36 b213)
    (on b213 b122)
    (on b122 b269)
    (on b269 b76)
    (on b76 b164)
    (on b164 b278)
    (on b278 b54)
    (on b54 b140)
    (on b140 b16)
    (on-table b16)
    (clear b66)
    (on b66 b53)
    (on b53 b209)
    (on b209 b312)
    (on b312 b262)
    (on b262 b298)
    (on b298 b55)
    (on b55 b165)
    (on-table b165)
    (clear b333)
    (on b333 b230)
    (on b230 b265)
    (on b265 b324)
    (on b324 b254)
    (on b254 b319)
    (on b319 b56)
    (on b56 b160)
    (on b160 b287)
    (on-table b287)
    (clear b114)
    (on b114 b106)
    (on b106 b52)
    (on-table b52)
    (clear b182)
    (on b182 b258)
    (on b258 b108)
    (on b108 b284)
    (on b284 b227)
    (on b227 b222)
    (on-table b222)
    (clear b267)
    (on b267 b177)
    (on-table b177)
    (clear b32)
    (on b32 b231)
    (on b231 b47)
    (on b47 b19)
    (on-table b19)
    (clear b238)
    (on b238 b31)
    (on-table b31)
    (clear b88)
    (on b88 b327)
    (on b327 b150)
    (on b150 b197)
    (on b197 b220)
    (on b220 b20)
    (on b20 b72)
    (on-table b72)
    (clear b11)
    (on b11 b71)
    (on b71 b282)
    (on-table b282)
    (clear b62)
    (on b62 b123)
    (on b123 b183)
    (on b183 b316)
    (on b316 b130)
    (on b130 b30)
    (on b30 b279)
    (on b279 b320)
    (on b320 b41)
    (on b41 b260)
    (on-table b260)
    (clear b211)
    (on-table b211)
    (clear b100)
    (on-table b100)
    (clear b214)
    (on b214 b313)
    (on b313 b180)
    (on b180 b335)
    (on b335 b157)
    (on b157 b280)
    (on b280 b28)
    (on b28 b240)
    (on-table b240)
    (clear b82)
    (on b82 b237)
    (on b237 b141)
    (on b141 b301)
    (on-table b301)
    (clear b263)
    (on-table b263)
    (clear b187)
    (on b187 b57)
    (on b57 b119)
    (on b119 b250)
    (on b250 b239)
    (on b239 b159)
    (on b159 b309)
    (on b309 b145)
    (on b145 b210)
    (on b210 b302)
    (on b302 b261)
    (on b261 b277)
    (on b277 b12)
    (on b12 b110)
    (on b110 b15)
    (on b15 b275)
    (on b275 b45)
    (on-table b45)
    (clear b103)
    (on b103 b196)
    (on b196 b94)
    (on b94 b185)
    (on b185 b129)
    (on-table b129)
    (clear b26)
    (on b26 b193)
    (on b193 b107)
    (on b107 b331)
    (on b331 b64)
    (on b64 b133)
    (on b133 b167)
    (on-table b167)
    (clear b305)
    (on-table b305)
    (clear b136)
    (on b136 b84)
    (on-table b84)
    (clear b271)
    (on b271 b92)
    (on b92 b272)
    (on b272 b116)
    (on b116 b200)
    (on b200 b146)
    (on b146 b259)
    (on b259 b293)
    (on-table b293)
    (clear b232)
    (on b232 b171)
    (on b171 b276)
    (on b276 b268)
    (on b268 b37)
    (on-table b37)
    (clear b60)
    (on-table b60)
    (clear b175)
    (on b175 b223)
    (on-table b223)
    (clear b339)
    (on b339 b14)
    (on-table b14)
    (clear b156)
    (on b156 b132)
    (on-table b132)
    (clear b13)
    (on-table b13)
    (clear b186)
    (on b186 b4)
    (on-table b4)
    (clear b101)
    (on b101 b120)
    (on-table b120)
    (clear b158)
    (on b158 b111)
    (on-table b111)
    (clear b102)
    (on-table b102)
    (clear b188)
    (on b188 b194)
    (on-table b194)
    (clear b270)
    (on b270 b151)
    (on b151 b73)
    (on b73 b7)
    (on b7 b332)
    (on b332 b27)
    (on-table b27)
    (clear b247)
    (on b247 b303)
    (on-table b303)
    (clear b292)
    (on b292 b176)
    (on-table b176)
    (clear b86)
    (on b86 b257)
    (on-table b257)
    (clear b149)
    (on b149 b6)
    (on b6 b205)
    (on b205 b161)
    (on b161 b216)
    (on b216 b85)
    (on b85 b50)
    (on b50 b170)
    (on b170 b318)
    (on-table b318)
    (clear b246)
    (on-table b246)
    (clear b49)
    (on b49 b25)
    (on b25 b134)
    (on-table b134)
    (clear b83)
    (on b83 b181)
    (on b181 b59)
    (on-table b59)
    (clear b207)
    (on b207 b184)
    (on b184 b325)
    (on-table b325)
    (clear b321)
    (on-table b321)
    (clear b233)
    (on-table b233)
    (clear b226)
    (on b226 b2)
    (on b2 b290)
    (on b290 b33)
    (on b33 b241)
    (on b241 b93)
    (on b93 b105)
    (on b105 b191)
    (on-table b191)
    (clear b113)
    (on b113 b138)
    (on b138 b48)
    (on b48 b199)
    (on b199 b307)
    (on b307 b43)
    (on-table b43))
 (:goal  (and 
    (clear b5)
    (on b5 b1)
    (on b1 b6)
    (on b6 b7)
    (on b7 b9)
    (on b9 b10)
    (on b10 b4)
    (on-table b4)
    (clear b8)
    (on b8 b2)
    (on b2 b3)
    (on-table b3))))

; plan
1. (unstack b149 b6)
   deleted: (on b149 b6) (clear b149) (arm-empty)
   added: (holding b149) (clear b6)
   goals met: 1 of 12
2. (putdown b149)
   deleted: (holding b149)
   added: (clear b149) (arm-empty) (on-table b149)
   goals met: 1 of 12
3. (unstack b152 b8)
   deleted: (on b152 b8) (clear b152) (arm-empty)
   added: (holding b152) (clear b8)
   goals met: 2 of 12
4. (putdown b152)
   deleted: (holding b152)
   added: (clear b152) (arm-empty) (on-table b152)
   goals met: 2 of 12
5. (unstack b154 b245)
   deleted: (on b154 b245) (clear b154) (arm-empty)
   added: (holding b154) (clear b245)
   goals met: 2 of 12
6. (putdown b154)
   deleted: (holding b154)
   added: (clear b154) (arm-empty) (on-table b154)
   goals met: 2 of 12
7. (unstack b186 b4)
   deleted: (on b186 b4) (clear b186) (arm-empty)
   added: (holding b186) (clear b4)
   goals met: 2 of 12
8. (putdown b186)
   deleted: (holding b186)
   added: (clear b186) (arm-empty) (on-table b186)
   goals met: 2 of 12
9. (unstack b226 b2)
   deleted: (on b226 b2) (clear b226) (arm-empty)
   added: (holding b226) (clear b2)
   goals met: 2 of 12
10. (putdown b226)
   deleted: (holding b226)
   added: (clear b226) (arm-empty) (on-table b226)
   goals met: 2 of 12
11. (unstack b245 b9)
   deleted: (on b245 b9) (clear b245) (arm-empty)
   added: (holding b245) (clear b9)
   goals met: 2 of 12
12. (putdown b245)
   deleted: (holding b245)
   added: (clear b245) (arm-empty) (on-table b245)
   goals met: 2 of 12
13. (unstack b270 b151)
   deleted: (on b270 b151) (clear b270) (arm-empty)
   added: (holding b270) (clear b151)
   goals met: 2 of 12
14. (putdown b270)
   deleted: (holding b270)
   added: (clear b270) (arm-empty) (on-table b270)
   goals met: 2 of 12
15. (unstack b151 b73)
   deleted: (on b151 b73) (clear b151) (arm-empty)
   added: (holding b151) (clear b73)
   goals met: 2 of 12
16. (putdown b151)
   deleted: (holding b151)
   added: (clear b151) (arm-empty) (on-table b151)
   goals met: 2 of 12
17. (unstack b288 b337)
   deleted: (on b288 b337) (clear b288) (arm-empty)
   added: (holding b288) (clear b337)
   goals met: 2 of 12
18. (putdown b288)
   deleted: (holding b288)
   added: (clear b288) (arm-empty) (on-table b288)
   goals met: 2 of 12
19. (unstack b337 b253)
   deleted: (on b337 b253) (clear b337) (arm-empty)
   added: (holding b337) (clear b253)
   goals met: 2 of 12
20. (putdown b337)
   deleted: (holding b337)
   added: (clear b337) (arm-empty) (on-table b337)
   goals met: 2 of 12
21. (unstack b253 b153)
   deleted: (on b253 b153) (clear b253) (arm-empty)
   added: (holding b253) (clear b153)
   goals met: 2 of 12
22. (putdown b253)
   deleted: (holding b253)
   added: (clear b253) (arm-empty) (on-table b253)
   goals met: 2 of 12
23. (unstack b153 b97)
   deleted: (on b153 b97) (clear b153) (arm-empty)
   added: (holding b153) (clear b97)
   goals met: 2 of 12
24. (putdown b153)
   deleted: (holding b153)
   added: (clear b153) (arm-empty) (on-table b153)
   goals met: 2 of 12
25. (unstack b61 b10)
   deleted: (on b61 b10) (clear b61) (arm-empty)
   added: (holding b61) (clear b10)
   goals met: 2 of 12
26. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 2 of 12
27. (unstack b69 b3)
   deleted: (on b69 b3) (clear b69) (arm-empty)
   added: (holding b69) (clear b3)
   goals met: 2 of 12
28. (putdown b69)
   deleted: (holding b69)
   added: (clear b69) (arm-empty) (on-table b69)
   goals met: 2 of 12
29. (unstack b3 b142)
   deleted: (on b3 b142) (clear b3) (arm-empty)
   added: (holding b3) (clear b142)
   goals met: 2 of 12
30. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 12
31. (unstack b73 b7)
   deleted: (on b73 b7) (clear b73) (arm-empty)
   added: (holding b73) (clear b7)
   goals met: 3 of 12
32. (putdown b73)
   deleted: (holding b73)
   added: (clear b73) (arm-empty) (on-table b73)
   goals met: 3 of 12
33. (unstack b78 b255)
   deleted: (on b78 b255) (clear b78) (arm-empty)
   added: (holding b78) (clear b255)
   goals met: 3 of 12
34. (putdown b78)
   deleted: (holding b78)
   added: (clear b78) (arm-empty) (on-table b78)
   goals met: 3 of 12
35. (unstack b255 b212)
   deleted: (on b255 b212) (clear b255) (arm-empty)
   added: (holding b255) (clear b212)
   goals met: 3 of 12
36. (putdown b255)
   deleted: (holding b255)
   added: (clear b255) (arm-empty) (on-table b255)
   goals met: 3 of 12
37. (unstack b212 b5)
   deleted: (on b212 b5) (clear b212) (arm-empty)
   added: (holding b212) (clear b5)
   goals met: 4 of 12
38. (putdown b212)
   deleted: (holding b212)
   added: (clear b212) (arm-empty) (on-table b212)
   goals met: 4 of 12
39. (unstack b97 b1)
   deleted: (on b97 b1) (clear b97) (arm-empty)
   added: (holding b97) (clear b1)
   goals met: 4 of 12
40. (putdown b97)
   deleted: (holding b97)
   added: (clear b97) (arm-empty) (on-table b97)
   goals met: 4 of 12
41. (unstack b1 b336)
   deleted: (on b1 b336) (clear b1) (arm-empty)
   added: (holding b1) (clear b336)
   goals met: 4 of 12
42. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 5 of 12
43. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 5 of 12
44. (stack b10 b4)
   deleted: (clear b4) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b4)
   goals met: 6 of 12
45. (unstack b2 b290)
   deleted: (on b2 b290) (clear b2) (arm-empty)
   added: (holding b2) (clear b290)
   goals met: 6 of 12
46. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 7 of 12
47. (unstack b7 b332)
   deleted: (on b7 b332) (clear b7) (arm-empty)
   added: (holding b7) (clear b332)
   goals met: 7 of 12
48. (stack b7 b9)
   deleted: (clear b9) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b9)
   goals met: 8 of 12
49. (unstack b5 b224)
   deleted: (on b5 b224) (clear b5) (arm-empty)
   added: (holding b5) (clear b224)
   goals met: 7 of 12
50. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 9 of 12
51. (unstack b8 b229)
   deleted: (on b8 b229) (clear b8) (arm-empty)
   added: (holding b8) (clear b229)
   goals met: 8 of 12
52. (stack b8 b2)
   deleted: (clear b2) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b2)
   goals met: 10 of 12
53. (unstack b7 b9)
   deleted: (on b7 b9) (clear b7) (arm-empty)
   added: (holding b7) (clear b9)
   goals met: 9 of 12
54. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 9 of 12
55. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 9 of 12
56. (stack b9 b10)
   deleted: (clear b10) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b10)
   goals met: 10 of 12
57. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 10 of 12
58. (stack b7 b9)
   deleted: (clear b9) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b9)
   goals met: 11 of 12
59. (unstack b5 b1)
   deleted: (on b5 b1) (clear b5) (arm-empty)
   added: (holding b5) (clear b1)
   goals met: 9 of 12
60. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 10 of 12
61. (unstack b1 b6)
   deleted: (on b1 b6) (clear b1) (arm-empty)
   added: (holding b1) (clear b6)
   goals met: 9 of 12
62. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 9 of 12
63. (unstack b6 b205)
   deleted: (on b6 b205) (clear b6) (arm-empty)
   added: (holding b6) (clear b205)
   goals met: 9 of 12
64. (stack b6 b7)
   deleted: (clear b7) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b7)
   goals met: 10 of 12
65. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 10 of 12
66. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 11 of 12
67. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 10 of 12
68. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 12 of 12
